elisp/org-annot/org-annotation-helper-faq.html
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>org-annotation-helper FAQ</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2008/09/18 10:49:00 AM"/>
<meta name="author" content="Daniel German"/>
</head><body>
<h1 class="title">org-annotation-helper FAQ</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Where is the documentation?</a></li>
<li><a href="#sec-2">2 What are the steps I need to follow to install org-annotation-helper?</a></li>
<li><a href="#sec-3">3 Is there an easy way to add the bookmarklets to my browser?</a></li>
<li><a href="#sec-4">4 Why is Remember so slow?</a></li>
<li><a href="#sec-5">5 I click on the bookmarklet and nothing happens. Now what?</a></li>
<li><a href="#sec-6">6 When using remember, I lose the formatting of the selected text.</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-3">
<h3 id="sec-1">1 Where is the documentation?</h3>
<div id="text-1">


<p>
It's in the header comment of org-annotation-helper.el.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-3">
<h3 id="sec-2">2 What are the steps I need to follow to install org-annotation-helper?</h3>
<div id="text-2">


<p>
In a nutshell, you should:
</p>
<p>
Step 1. Install the elisp scripts (you do this in emacs)
</p>
<p>
Step 2. Add the bookmarklets (you do this in your browser)
</p>
<p>
Step 3. Configure the browser to handle the annotation:// and
remember:// URL protocol (you do this in your browser)
Step 4. Test
</p>
<p>
See org-annotation-helper.el for detailed instructions.
</p>

</div>

</div>

<div id="outline-container-3" class="outline-3">
<h3 id="sec-3">3 Is there an easy way to add the bookmarklets to my browser?</h3>
<div id="text-3">


<p>
Just drag the following links to your bookmarks toolbar:
</p>


<a href="javascript:location.href='remember://' + location.href + '::remember::' + escape(document.title) + '::remember::' + escape(window.getSelection())">Remember</a>
<p>
Use remember to start a remember buffer in emacs, with a link
to the current page, and the highlighted text. See the documentation
for more details.
</p>



<a href="javascript:location.href='annotation://' + location.href + '::remember::' + escape(document.title)">Annotation</a>
<p>
Use annotation to store a link to the current page on the
kill ring, where it can be retrieved using yank or using
org-insert-link.
</p>
</div>

</div>

<div id="outline-container-4" class="outline-3">
<h3 id="sec-4">4 Why is Remember so slow?</h3>
<div id="text-4">


<p>
Emacs will take some time to process your links if you highlight a
very large region of text (it has to hexdecode the entire
region). Note also that the size of the region you highlight is
limited by the maximum size of the command line in your shell:
anything more will be truncated.
</p>
</div>

</div>

<div id="outline-container-5" class="outline-3">
<h3 id="sec-5">5 I click on the bookmarklet and nothing happens. Now what?</h3>
<div id="text-5">


<p>
You need to debug the problem incrementally. Let us assume
your org-annotation-helper script is located at
/home/dmg/bin/org-annotation-helper and that /home/dmg/bin
is included in your $PATH.
</p>
<ul>
<li id="sec-5.1"><b>First</b>:<br/>

<p>
Make sure that the emacs server is started: add (server-mode) in
your .emacs  and restart emacs or start it interactively with M-x server-mode &lt;RET&gt;  
</p>
<p>
Try to execute, from the command line:
</p>
<p>
<pre>
  /home/dmg/bin/org-annotation-helper 'remember://http%3A//orgmode.org/::remember::Org-Mode%20Homepage::remember::Notes'
</pre>
and 
<pre>
  /home/dmg/bin/org-annotation-helper 'annotation://http%3A//orgmode.org/::remember::Org-Mode%20Homepage'
</pre>
</p>

<p>
This should start remember in emacs (in the first case) or add the
link to the kill ring of emacs (in the second case). If emacs does not
respond, check that the server is running:
</p>
<p>
<pre>
  emacsclient .emacs
</pre>
</p>
<p>
That way you will know if the problem lies in emacs or in the
org-annotation-helper script.
</p>
<p>
<b>Do not proceed until org-annotation-helper works.</b>
</p>
</li>
<li id="sec-5.2"><b>Second</b>:<br/>

<p>
Try to follow the following URLs in your browser:
</p>


<a href="remember://http://orgmode.org/::remember::Org-Mode Homepage">remember://http://orgmode.org/::remember::Org-Mode Homepage</a>

<p>
and
</p>


<a href="annotation://http://orgmode.org/::remember::Org-Mode Homepage">annotation://http://orgmode.org/::remember::Org-Mode Homepage</a><br>

<p>
The first link should bring up a <b>Remember</b> buffer in emacs with a link
to the orgmode home page. The second should squirrel the link away so
you can retrieve it in an org mode buffer in emacs with M-x org-insert-link
(usually bound to C-c C-l).
</p>
<p>
If there are problems, try uncommenting the following line in org-annotation-helper:
</p>
<p>
<pre>
   #echo $1 &gt;&gt; /tmp/remember.out
</pre>
</p>
<p>
and checking out the /tmp/remember.out file: clicking one of the links should add to the file
a line like this:
</p>
<p>
<pre>
  remember://http://orgmode.org/::remember::Org-Mode Homepage
</pre>
</p>
<p>
or like this:
</p>
<p>
<pre>
  annotation://http://orgmode.org/::remember::Org-Mode Homepage
</pre>
</p>
<p>
If that is not the case, the browser setup is incorrect or incomplete.
Make sure that your browser is properly configured to handle the
"remember://" and "annotate://" protocol.  Refer to the documentation
for the details (see FAQ#0 above).
</p>
<p>
<b>Do not proceed until these links work as expected.</b>
</p>
</li>
<li id="sec-5.3"><b>Third</b>:<br/>

<p>
It still does not work. Seek help in the org-mode mailing list and Cc: me. 
</p>
</li>
</ul>
</div>

</div>

<div id="outline-container-6" class="outline-3">
<h3 id="sec-6">6 When using remember, I lose the formatting of the selected text.</h3>
<div id="text-6">


<p>
org-annotation-helper does not preserve formatting. Text is
copied and pasted as a long string. Use M-q to "fill" the region.
</p>



</div>
</div>
<div id="postamble"><p class="author"> Author: Daniel German
<a href="mailto:dmg at uvic dot ca">&lt;dmg at uvic dot ca&gt;</a>
</p>
<p class="date"> Date: 2008/09/18 10:49:00 AM</p>
<p>HTML generated by org-mode 6.06pre01 in emacs 23<p>
</div></body>
</html>
